model1-taurus-plan.yml
---
modules:
  local:
    sequential: true
  jmeter:
    gui: false

execution:
- concurrency: 500
  hold-for: 3600s
  iterations: 10
  ramp-up: 10s
  scenario: source-activity-scenario

scenarios:
  source-activity-scenario:
    requests:
    - url: http://skipjaq.com/jobs
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/management
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/jobs/pl/staff_engineer
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/jobs.html
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/offices
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/board
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/team
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/jobs/uk/senior_staff_engineer
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/offices.html
      method: GET
      assert:
        http-code: 200
    - url: http://skipjaq.com/brand.html
      method: GET
      assert:
        http-code: 200